blogs/self-inflicted-ddos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>如何避免自己ddos自己</title>
<!-- 2018-03-04 日 16:07 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="zhengzhiyong" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">如何避免自己ddos自己</h1>
<p>
早些时间读到一篇文章， <a href="https://cloudplatform.googleblog.com/2016/11/how-to-avoid-a-self-inflicted-DDoS-Attack-CRE-life-lessons.html">how to avoid a self inflicted ddos</a> ，觉得这都是常识，不相信自己会ddos自己。直到有天同事跟我打电话，说我把他们的接口干死了。我在上万台机器部署了分钟级cron，肯定被我ddos了，这里总结下，如何避免ddos自己。
</p>

<p>
自己ddos自己，一般由客户端导致，通常和定时任务有关。为了避免ddos自己，应该特别注意：
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 定时任务加上随机等待</h2>
<div class="outline-text-2" id="text-1">
<p>
例如linux的cron中，经常可以看到 <code>sleep $(($RANDOM\%30)) &amp;&amp; &lt;command&gt;</code> 这里执行 &lt;command&gt; 前随机等待30S，避免0s的峰值。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 失败重试采用指数时间间隔</h2>
<div class="outline-text-2" id="text-2">
<p>
通常失败后重试，都是一个固定的时间间隔，例如：等待1s，然后重试，直到超过最大重试次数。暂时故障时，固定间隔重试会导致大量重试。此时可以采用指数间隔，例如第一次1s，第二次2s，第三次4s，第四次8s。还可以采用斐波那契间隔，第一次1s，第二次1s，第三次2s，第四次3s，第五次5s。斐波那契比指数重试间隔要小。
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 客户端缓存</h2>
<div class="outline-text-2" id="text-3">
<p>
对于不经常改变的内容，可以增加客户端缓存。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zhengzhiyong</p>
<p class="date">Created: 2018-03-04 日 16:07</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
